app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @booknew = Book.new
    @book = Book.find(params[:id])

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sss"], ["body", "sssssssssss"], ["user_id", 2], ["created_at", "2020-09-02 09:25:59.337437"], ["updated_at", "2020-09-02 09:25:59.337437"]]
SELECT "books".* FROM "books"
---
  def create
    @user = current_user
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "You have created book successfully."
    else
      @books = Book.all