app/controllers/searches_controller.rb

	def search
    @range = params[:range]
    search = params[:search]
    word = params[:word]

   if params[:range] == '1'
       @user = User.search(search,word)
     else
      @book = Book.search(search,word)
---
SELECT "users".* FROM "users" WHERE (name LIKE'%a%')
SELECT "books".* FROM "books" WHERE (title LIKE'%test%')